<?php

namespace Database\Seeders;
use Spatie\Permission\Models\Permission;

use Illuminate\Database\Seeder;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
           
            'متدرب',

            'طباعة',
            'عرض التقارير',

            'قبول اجازة',
            'قبول استقالة',

            'طلب استقالة',
            'طلب اجازة',
            'طلب تدريب',


            'عرض كلية',
            'انشاء كلية',
            'تعديل كلية',
            'حذف كلية',

            'عرض علاوة',
            'انشاء علاوة',
            'تعديل علاوة',
            'حذف علاوة',

            'عرض مرتب',
            'انشاء مرتب',
            'تعديل مرتب',
            'حذف مرتب',
            'صرف مرتب',

            'عرض قسم',
            'انشاء قسم',
            'تعديل قسم',
            'حذف قسم',

            'عرض وظيفة',
            'انشاء وظيفة',
            'تعديل وظيفة',
            'حذف وظيفة',

            'عرض درجة وظيفية',
            'انشاء درجة وظيفية',
            'تعديل درجة وظيفية',
            'حذف درجة وظيفية',

            'عرض تخصص',
            'انشاء تخصص',
            'تعديل تخصص',
            'حذف تخصص',

            'عرض اجازة',
            'اضافة اجازة',
            'تعديل اجازة',
            'حذف اجازة',

            'عرض ترقية',
            'اضافة ترقية',
            'تعديل ترقية',
            'حذف ترقية',

            'عرض استقالة',
            'اضافة استقالة',
            'تعديل استقالة',
            'حذف استقالة',

            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            
            'عرض مستخدم',
            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',


            ];

       foreach ($permissions as $permission) {
       Permission::create(['name' => $permission]);
            }
    }//end of run
}
